{
    "personal_info": {
        "name": "Rafael Pinto",
        "title": "Senior Software Developer",
        "phone": "+55 84 994337518",
        "email": "rrafaelpinto@gmail.com",
        "linkedin": "https://www.linkedin.com/in/rafaelmpinto/"
    },
    "about": {
        "education": [
            "PhD in Computer Science (2022)",
            "Master's degree in Computer Science (2016)",
            "Specialist in Technology and Software Development for Web (2007)",
            "Bachelor in Systems Information (2004)"
        ],
        "experience": "Senior software developer with 20 years of experience in design and development of web applications, mainly working with Python (+10y), Django (+10y), MS SQL Server and PostgreSQL (+10y).",
        "current_position": "Since 2014 working at Federal Institute of Science and Technology where act as Python Developer.",
        "phd_research": "As data analyst, he developed a software ecosystem in Python and R for collecting, cleaning, and processing data using Natural Language Processing - NLP (+5y ) and Machine Learning - ML (+5y ) algorithms in order to analyze the effects of a public health intervention from a perspective over time. Findings from the processed data were plotted in graphs using Matplotlib and Plotly, allowing the discussion of the impacts with different stakeholders."
    },
    "skills": {
        "programming_languages": [
            "Python",
            "React",
            "HTML",
            "JavaScript",
            "Json",
            "CSS",
            "MS SQL Server",
            "PostgreSQL",
            "GitLab"
        ],
        "frameworks": [
            "Django",
            "Django REST",
            "Machine Learning (ML)",
            "Natural Language Processing (NLP)",
            "Pandas"
        ],
        "tools": [
            "GitLab (CI/CD)",
            "Agile Methodologies (Scrum)",
            "Full Software Development Lifecycle (SDLC)",
            "Copilot"
        ],
        "project_management": [
            "Project Planning and Coordination"
        ]
    },
    "experience": [
        {
            "company": "LAIS - Laboratory for Technological Innovation in Health",
            "location": "Remote",
            "title": "Senior Software Developer",
            "period": "Feb 2023 - Present",
            "project_name": "Telehealth",
            "context": "LAIS is a research and development laboratory focused on healthcare innovation, operating at the intersection of academia, public policy, and digital transformation in Brazil. In this role, contributed to the architecture and development of a large-scale national telehealth platform, designed to support remote healthcare delivery, medical coordination, and real-time data processing across the Brazilian Unified Health System (SUS).",
            "responsibilities": [
                "Led the end-to-end development of backend services using Python and Django, integrating health data pipelines and ensuring scalability and performance under real-time workloads.",
                "Designed RESTful APIs for secure interoperability with government systems, and began exploring FastAPI as a lightweight alternative for high-performance microservices.",
                "Collaborated with front-end teams working with React + Next.js to integrate dynamic user interfaces with Django REST APIs, ensuring consistent data flow and user experience across the telehealth platform.",
                "Facilitated Agile development through sprint planning, code reviews, and mentoring sessions, aligning cross-functional teams around delivery goals and engineering standards.",
                "Collaborated closely with health domain experts and stakeholders to translate functional requirements into clear, actionable technical specifications."
            ]
        },
        {
            "company": "LAIS - Laboratory for Technological Innovation in Health",
            "location": "Remote",
            "title": "Senior Software Developer",
            "period": "Feb 2018 - Feb 2023",
            "project_name": "Hermes",
            "context": "As part of a national public health initiative (\"Syphilis No!\") contributed to the design and implementation of Hermes, a modular data analysis ecosystem developed to monitor media coverage, evaluate public health campaigns, and inform evidence-based policy decisions.",
            "responsibilities": [
                "Developed an end-to-end data processing platform in Python, integrating Scrapy, Pandas, and NLTK to collect, clean, and structure large volumes of unstructured online news data.",
                "Applied Natural Language Processing (NLP) techniques — including sentiment analysis (VADER), TF-IDF, and DBSCAN clustering — to extract trends and detect thematic patterns from online news articles related to syphilis and public health awareness, collected via Google Search Engine API.",
                "Performed statistical modeling using Interrupted Time Series (ITS) and segmented regression to assess the measurable impact of government interventions on congenital syphilis rates.",
                "Automated data pipelines and ensured reproducibility through CI/CD workflows in GitLab, promoting operational efficiency and analytical consistency across project phases."
            ],
            "project_highlights": [
                {
                    "technique": "Sentiment Analysis using the VADER algorithm",
                    "description": "Adapted the VADER algorithm for Brazilian Portuguese to analyze the sentiment of online news articles related to the 'Syphilis No!' Project, identifying the impact of news sentiments on public health actions.",
                    "field": "Natural Language Processing"
                },
                {
                    "technique": "Text Mining and Clustering using DBSCAN",
                    "description": "Utilized the Hermes ecosystem to preprocess and cluster online news articles about syphilis using TF-IDF and the DBSCAN algorithm, assessing the influence of public health campaigns on media coverage.",
                    "field": "Text Mining"
                },
                {
                    "technique": "Text Mining and Feature Extraction using Bigrams and TF-IDF",
                    "description": "Employed the Hermes digital ecosystem to extract and categorize news articles, analyzing the quality and quantity of news coverage to evaluate the effectiveness of public health communication campaigns.",
                    "field": "Text Mining"
                },
                {
                    "technique": "Interrupted Time Series (ITS) Analysis and Segmented Regression",
                    "description": "Applied ITS and segmented regression to assess the impact of the 'Syphilis No!' Project on congenital syphilis rates, demonstrating the effectiveness of targeted public health interventions.",
                    "field": "Statistical Analysis"
                }
            ]
        },
        {
            "company": "LAIS - Laboratory for Technological Innovation in Health",
            "location": "Remote",
            "title": "Software Developer",
            "period": "Feb 2015 - Feb 2018",
            "project_name": "Simaies",
            "context": "SIMAIES (Monitoring and Evaluation System for Health Education Integration) is a national web platform developed under Brazil’s COAPES framework, enabling coordination between medical schools and public health services as part of the "Mais Médicos" program. Designed to support the governance of partnerships in primary care, SIMAIES facilitates the management, evaluation, and transparency of agreements between educational institutions and municipal health departments.",
            "responsibilities": [
                "Developed scalable web applications using Python and Django, applying clean architecture principles and modular design patterns to support maintainability and extensibility.",
                "Built and consumed RESTful APIs, ensuring smooth communication between backend services and frontend interfaces.",
                "Modeled and optimized PostgreSQL databases to enforce data integrity and support complex workflows involving academic institutions and health secretariats.",
                "Created unit and integration tests to safeguard code reliability and maintain continuous quality across evolving system components.",
                "Participated in Agile/Scrum development cycles, contributing to sprint planning, retrospectives, and velocity tracking.",
                "Authored and maintained technical documentation covering API endpoints, system architecture, and feature specifications.",
                "Collaborated with non-technical stakeholders — including public health managers and educators — to gather requirements and translate them into actionable technical solutions.",
                "Mentored junior developers, promoting adherence to coding standards, version control practices, and peer review workflows."
            ]
        },
        {
            "company": "Athabasca University",
            "location": "Edmonton, Alberta, Canada",
            "title": "Software Engineer | Data Engineer",
            "period": "Sep 2019 - Dec 2020",
            "context": "Athabasca University is a leading online university in Canada, known for its innovative approach to distance education and research. During my time as a Software Engineer and Data Engineer, I supported academic research by developing data pipelines and analytical tools to facilitate policy and behavioral studies.",
            "duration": "1 yr 4 mos",
            "responsibilities": [
                "Supported academic research through the design of data pipelines and analytical tools for policy and behavioral studies.",
                "Developed data ingestion tools in Python, integrating data from REST APIs and web scraping via Scrapy for structured analysis.",
                "Conducted both qualitative and quantitative analysis, transforming raw datasets into actionable insights.",
                "Researched and evaluated emerging machine learning frameworks for use in academic and social data contexts.",
                "Designed data visualizations, spreadsheets, and presentation materials to clearly communicate findings to diverse audiences.",
                "Actively contributed to research meetings and knowledge exchange sessions with faculty and technical teams."
            ]
        },
        {
            "company": "Thalocan Research Innovations",
            "location": "Remote",
            "title": "Project Manager / Technical Lead",
            "period": "Jan 2024 - Dec 2024",
            "context": "Thalocan is a healthtech company specializing in digital solutions for clinical trials. As Technical Lead, spearheaded the development of LAMA (Lesion Area Mapping Assistant), a cloud-based platform designed to streamline lesion assessment in dermatologic studies. LAMA allows clinical investigators to capture images, map lesions, and document severity using mobile devices, supporting real-time data sharing between investigators, CROs, and sponsors — improving both diagnostic accuracy and data traceability in treatment evaluation.",
            "duration": "1 yr (Contract)",
            "responsibilities": [
                "Led a multidisciplinary team from project inception to delivery, overseeing planning, execution, and delivery of high-quality, regulation-aligned digital health solutions.",
                "Conducted stakeholder interviews to define business requirements, system constraints, and success criteria, translating them into comprehensive technical documentation and functional specs.",
                "Designed and managed project schedules, orchestrating dependencies, deadlines, and resource allocation to meet scope and delivery targets.",
                "Applied Agile (Scrum) methodologies through sprint planning, daily stand-ups, and retrospectives, fostering adaptability, collaboration, and steady delivery cadence.",
                "Identified and mitigated both technical and organizational risks throughout the development cycle, ensuring minimal disruption and on-time delivery.",
                "Maintained detailed project records — from initial requirements to final handoff — ensuring full traceability, transparency, and efficient knowledge transfer."
            ]
        },
        {
            "company": "Court of Justice of Rio Grande do Norte (TJRN)",
            "location": "Natal Area, Brazil",
            "title": "Software Developer",
            "period": "Sep 2010 - Apr 2014",
            "duration": "3 yr 8 mos",
            "responsibilities": [
                "Built software architecture using Java components",
                "Developed object-oriented web applications",
                "Mentored interns and junior developers",
                "Participated in code review meetings",
                "Documented technical specifications and project testing methods"
            ]
        },
        {
            "company": "Memes Educational Technology",
            "location": "São Paulo Area, Brazil",
            "title": "Software Developer",
            "period": "Jan 2008 - Aug 2010",
            "duration": "2 yr 8 mos",
            "responsibilities": [
                "Developed and maintained a communication portal for distance learning",
                "Developed object-oriented web applications",
                "Researched alternative solutions",
                "Modified existing software systems",
                "Conducted full lifecycle software development",
                "Consumed and implemented REST APIs for payment integration"
            ]
        }
    ],
    "education": [
        {
            "degree": "Doctor’s Degree, Computer Science",
            "institution": "Federal University of Rio Grande do Norte",
            "location": "Natal Area, Brazil",
            "period": "2019 - 2022"
        },
        {
            "degree": "Master’s Degree, Computer Software Engineering",
            "institution": "Federal University of Rio Grande do Norte",
            "location": "Natal Area, Brazil",
            "period": "2014 - 2016"
        },
        {
            "degree": "Specialization, Computer Systems Analysis",
            "institution": "Potiguar University",
            "location": "Natal Area, Brazil",
            "period": "2006 - 2007"
        },
        {
            "degree": "Bachelor’s Degree, Computer Systems Analysis",
            "institution": "Potiguar University",
            "location": "Natal Area, Brazil",
            "period": "2001 - 2004"
        }
    ],
    "languages": [
        {
            "English": "Full professional proficiency"
        },
        {
            "Spanish": "Limited working proficiency"
        },
        {
            "Portuguese": "Native or bilingual proficiency"
        }
    ],
    "soft_skills": [
        {
            "skill": "Collaboration",
            "description": "As a Senior Software Developer and Project Manager, I have consistently worked within diverse teams, fostering a collaborative environment to achieve project goals. My ability to collaborate effectively has been instrumental in delivering complex projects, such as the Unified Public Administration System (SUAP) and the Telehealth Project, where teamwork and mutual support were crucial to success."
        },
        {
            "skill": "Communication (Transparency)",
            "description": "Throughout my career, I have prioritized clear and transparent communication with both technical and non-technical stakeholders. This skill has been essential in roles such as managing the Telehealth Project, where ensuring that all parties are well-informed and aligned has led to more efficient project execution and stakeholder satisfaction."
        },
        {
            "skill": "Emotional Intelligence (Empathy)",
            "description": "My roles have required a high degree of emotional intelligence, particularly empathy, to understand and address the needs and concerns of team members and stakeholders. This has been evident in my work at LAIS, where empathetic leadership has fostered a positive work environment and enhanced team productivity."
        },
        {
            "skill": "Organization",
            "description": "My organizational skills have been a cornerstone of my professional success, enabling me to manage multiple projects and responsibilities effectively. From developing detailed project plans to overseeing the full software development lifecycle, my ability to stay organized has ensured the timely and successful delivery of projects."
        }
    ],
    "portfolio": [
        {
            "project_name": "ResumeBot",
            "github_url": "https://github.com/rrafaelpinto/mychatbot/",
            "description": "A web-based AI assistant designed to answer user questions about resumes using OpenAI's language models via LangChain. Developed as a full-stack Django application, the platform supports real-time interactions, session tracking, and user-specific answers.",
            "technologies": [
                "Python",
                "Django",
                "OpenAI API",
                "LangChain",
                "JavaScript (jQuery)",
                "Bootstrap"
            ],
            "key_features": [
                "Integrated OpenAI language models into a secure backend using LangChain",
                "Developed RESTful APIs and managed user session logic for personalized interaction",
                "Designed responsive UI with Bootstrap; ensured compliance with secure data handling practices"
            ],
            "responsibilities": [
                "Developed and maintained the web application using Django framework",
                "Integrated OpenAI's language models to provide real-time, accurate responses",
                "Utilized LangChain for managing interactions with the language model",
                "Implemented user identification and interaction logging features",
                "Designed responsive front-end using Bootstrap and jQuery",
                "Ensured secure handling of user data and interactions",
                "Created a personalized experience by leveraging user input and session management"
            ],
            "highlights": "Demonstrates practical application of LLMs in backend systems and user-focused AI integration, aligning with modern AI-first engineering environments",
            "purpose": "Serves as part of the personal portfolio of Rafael Pinto, demonstrating skills and expertise in building web applications using advanced AI technologies"
        }
    ]
}